# LayoutRuleFixedNumber Properties

---
The LayoutRuleFixedNumber type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| NumberOfLines| Get or set the number of the beams in a beam system.
Top
#### Reference
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace